#include "cycles.h"

#include <iostream>


int mainWhile() {

    // =========================================
    //  While
    // =========================================

    std::cout << 1 << std::endl;
    std::cout << 2 << std::endl;
    std::cout << 3 << std::endl;
    std::cout << 4 << std::endl;
    std::cout << 5 << std::endl;


    // while (условие)
    // {
    //     код;
    // }

    // Работает так:
    // - Проверяет условие.
    // - Если условие true — выполняет тело цикла.
    // - Возвращается к проверке.
    // - Если условие false — выходит из цикла.

    // Любой цикл обяза иметь "три кита"
    // - счетчик    (int i = 0)
    // - условие    (i <= 1000)
    // - обновление (++i      )

    int i = 35;

    while (i <= 48) {
        std::cout << i << std::endl;
        ++i;
    }

    // Бесконечный цикл

    while (true)
    {
        std::cout << "Работаю" << std::endl;
    }

    i = 1;

    while (true)
    {
        std::cout << i << std::endl;

        if (i == 5)
        {
            break;
        }

        ++i;
    }

    i = 0;

    while (i < 5)
    {
        ++i;

        if (i == 3)
        {
            std::cout << ":)" << std::endl;
            continue;
        }

        std::cout << i << std::endl;
    }

    // =========================================
    //  do-while
    // =========================================


    // Тот же самый while только тело цикла выполняется минимум один раз
    // do
    // {
    //     код;
    // }
    // while (условие);

    i = 35;

    do
    {
        std::cout << i << std::endl;
        ++i;
    }
    while (i <= 10);

    // =========================================
    //  for
    // =========================================

    // for (инициализация (счетчик); условие; обновление)
    // {
    //     код;
    // }

    // int i = 35;

    // while (i <= 48) {
    //     std::cout << i << std::endl;
    //     ++i;
    // }

    for (int j = 0; j <= 10; ++j) {
        std::cout << "* " << j << std::endl;
    }


    return 0;
}
